/*

물품을 등록하고 등록된 물품을 랜덤한 수만큼 판매하고 누적 판매 현황을 출력하는 프로그램

- 물품 등록 기능
  + 상품 이름, 가격 등록
- 물품 판매 기능
  + 등록된 상품 중에서 랜덤한 상품을 랜덤한 수만큼 판매하고 누적 판매 현황을 출력한다.

########## Sample Run
1번째 상품의 이름을 입력하세요 : [ 그만 등록하시려면 'e'를 누르세요. ] 
사과
사과의 가격을 입력하세요 :  1000

2번째 상품의 이름을 입력하세요 : [ 그만 등록하시려면 'e'를 누르세요. ]
배
배의 가격을 입력하세요 :  5000

3번째 상품의 이름을 입력하세요 : [ 그만 등록하시려면 'e'를 누르세요. ]
자몽
자몽의 가격을 입력하세요 :  15000

4번째 상품의 이름을 입력하세요 : [ 그만 등록하시려면 'e'를 누르세요. ]
포도
포도의 가격을 입력하세요 :  25000

5번째 상품의 이름을 입력하세요 : [ 그만 등록하시려면 'e'를 누르세요. ]
e
[[ 물품 등록을 종료합니다. ]]

진행을 원하시면 [c]를, 끝내시려면 [e]를 입력하세요.
c

[[ '사과' 상품을 6개 팔았습니다! ]]

[[현재 판매 현황 ]]
   - 사과 상품을 6개 팔았습니다.
   - 배 상품을 0개 팔았습니다.
   - 자몽 상품을 0개 팔았습니다.
   - 포도 상품을 0개 팔았습니다.
 $$ 총 매출은 6000원 입니다. $$


진행을 원하시면 [c]를, 끝내시려면 [e]를 입력하세요.
c

[[ '자몽' 상품을 4개 팔았습니다! ]]

[[현재 판매 현황 ]]
   - 사과 상품을 6개 팔았습니다.
   - 배 상품을 0개 팔았습니다.
   - 자몽 상품을 4개 팔았습니다.
   - 포도 상품을 0개 팔았습니다.
 $$ 총 매출은 66000원 입니다. $$


진행을 원하시면 [c]를, 끝내시려면 [e]를 입력하세요.
c

[[ '포도' 상품을 8개 팔았습니다! ]]

[[현재 판매 현황 ]]
   - 사과 상품을 6개 팔았습니다.
   - 배 상품을 0개 팔았습니다.
   - 자몽 상품을 4개 팔았습니다.
   - 포도 상품을 8개 팔았습니다.
 $$ 총 매출은 266000원 입니다. $$


진행을 원하시면 [c]를, 끝내시려면 [e]를 입력하세요.
c

[[ '배' 상품을 5개 팔았습니다! ]]

[[현재 판매 현황 ]]
   - 사과 상품을 6개 팔았습니다.
   - 배 상품을 5개 팔았습니다.
   - 자몽 상품을 4개 팔았습니다.
   - 포도 상품을 8개 팔았습니다.
 $$ 총 매출은 291000원 입니다. $$


진행을 원하시면 [c]를, 끝내시려면 [e]를 입력하세요.
c

[[ '사과' 상품을 8개 팔았습니다! ]]

[[현재 판매 현황 ]]
   - 사과 상품을 14개 팔았습니다.
   - 배 상품을 5개 팔았습니다.
   - 자몽 상품을 4개 팔았습니다.
   - 포도 상품을 8개 팔았습니다.
 $$ 총 매출은 299000원 입니다. $$


진행을 원하시면 [c]를, 끝내시려면 [e]를 입력하세요.
e


[[ 총 판매 현황 ]]
   - 사과 상품을 14개 팔았습니다.
   - 배 상품을 5개 팔았습니다.
   - 자몽 상품을 4개 팔았습니다.
   - 포도 상품을 8개 팔았습니다.
 $$ 총 매출은 299000원 입니다. $$


[[ 프로그램을 종료합니다 ]]
 */
package edu_java_2017.question;

import java.util.Scanner;

public class hw01 
{
	static Scanner scan = new Scanner(System.in);
	
	//상품 등록
	public static void insertProd()
	{		

	}

	//상품 판매
	public static void sellProd()
	{

	}
	
	//판매 현황 출력 함수
	public static void totalSell(char end)
	{

	}
	

	public static void main(String[] args) 
	{
		
	}
}
